# mac-devbox Brewfile
# GUI applications and fonts managed by Homebrew Cask.
# CLI tools are managed by Nix / home-manager (home.nix).
#
# Install all at once:   brew bundle --file=~/mac-devbox/Brewfile
# Check what's missing:  brew bundle check --file=~/mac-devbox/Brewfile

# ── Terminal ────────────────────────────────────────────────────────────────
cask "warp"                  # AI-native terminal

# ── Fonts (required for Starship prompt icons) ───────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ── IDEs & Editors ──────────────────────────────────────────────────────────
cask "intellij-idea"         # Java / Spring Boot IDE (Ultimate)
cask "visual-studio-code"    # General-purpose editor

# ── Browsers ────────────────────────────────────────────────────────────────
cask "brave-browser"         # Primary browser

# ── Security ────────────────────────────────────────────────────────────────
cask "bitwarden"             # Password manager

# ── Communication ───────────────────────────────────────────────────────────
cask "slack"
cask "microsoft-teams"

# ── Mail ────────────────────────────────────────────────────────────────────
cask "readdle-spark"       # Multi-account mail client

# ── Containers ──────────────────────────────────────────────────────────────
cask "docker-desktop"        # Docker Desktop (includes docker + compose CLI)

# ── Productivity & launcher ─────────────────────────────────────────────────
cask "raycast"               # Launcher, clipboard history, window management
                             # (replaces Spotlight + Alfred + Rectangle + Maccy)

# ── Windows → Mac transition helpers ────────────────────────────────────────
cask "alt-tab"               # Windows-style Alt+Tab (switches windows, not just apps)
cask "karabiner-elements"    # Key remapping: Ctrl shortcuts work like Cmd for muscle memory
cask "cheatsheet"            # Hold ⌘ in any app to see all its shortcuts

# ── Menu bar ────────────────────────────────────────────────────────────────
cask "stats"                 # System monitor in menu bar (CPU, RAM, network)
cask "jordanbaird-ice"       # Menu bar organiser / icon hider

# ── Utilities ───────────────────────────────────────────────────────────────
cask "the-unarchiver"        # Opens zip, rar, 7z, tar — like 7-Zip
